temp1/src/InformationRegisters/ЦветаПриоритетов/ЦветаПриоритетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦветаПриоритетов</name>
  <resources>
    <name>Цвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/InformationRegisters/ЦветаПриоритетов/ManagerModule.bsl
Функция ПолучитьЦветПриоритета(Приоритет) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦветаПриоритетов.Цвет КАК Цвет
	|ИЗ
	|	РегистрСведений.ЦветаПриоритетов КАК ЦветаПриоритетов
	|ГДЕ
	|	ЦветаПриоритетов.Приоритет = &Приоритет";
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цвет;
	КонецЕсли;
	Возврат 0;
КонецФункции
